tap "homebrew/cask"
tap "aws/tap"
tap "hashicorp/tap"
tap "weaveworks/tap"
cask_args appdir: "/Applications"

brew "awscli"
brew "bat"
brew "colordiff"
brew "curl"
brew "direnv"
brew "eksctl"
brew "exa"
brew "kubectl", link: true
brew "ffmpeg"
brew "fzf"
brew "git"
brew "git-secrets"
brew "grep", link: true
brew "helm"
brew "htop"
brew "imagemagick"
brew "jq"
brew "mas"
brew "mysql-client", link: true
brew "nkf"
brew "nodenv"
brew "openssl"
brew "procs"
brew "starship"
brew "thefuck"
brew "tmux"
brew "tree"
brew "unzip"
brew "vim"
brew "wget"
brew "yq"

tap "homebrew/cask-fonts"
cask "font-migu-1p"
brew "font-hackgen"
brew "font-hackgen-nerd"


cask "alfred"
cask "docker"
cask "google-chrome"
cask "iterm2"
cask "visual-studio-code"
cask "flux"
cask "drawio"
cask "slack"
cask "zoom"

